Shiksha-API: Durable functions README update
